app/views/teams/edit.html.erb

  controller.redirect_to '/static_pages'
  if !Student.exists?(:email => current_user.email)
---
SELECT "students".* FROM "students"
SELECT 1 AS one FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "czt@123.com"], ["LIMIT", 1]]