app/views/teams/edit.html.erb

SELECT "students".* FROM "students"
---
  <h4><strong>Students:</strong></h4>
<% @team.students.each do |student|%>