app/views/teams/index.html.erb

    s = Student.find_by(:email => current_user.email)
    s.teams.each do |team|
---
SELECT "teams".* FROM "teams"