app/views/teams/index.html.erb

SELECT "students".* FROM "students" INNER JOIN "student_teams" ON "students"."id" = "student_teams"."student_id" WHERE "student_teams"."team_id" = ?  [["team_id", 1]]
---
        <td>
        <% team.students.each do |student|%>

SELECT 1 AS one FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "test2@123.com"], ["LIMIT", 1]]
---
  controller.redirect_to '/static_pages'
  if !Student.exists?(:email => current_user.email)