app/views/teams/show.html.erb

SELECT "students".* FROM "students" INNER JOIN "student_teams" ON "students"."id" = "student_teams"."student_id" WHERE "student_teams"."team_id" = ? ORDER BY "students"."id" ASC LIMIT ?  [["team_id", 1], ["LIMIT", 1]]
---
  <strong>Students:</strong>
  <% @team.students.each do |student|%>