app/views/static_pages/index.html.erb

SELECT "students".* FROM "students" WHERE (email = student5@123.com)
---
<%
 if current_user.role == User.roles.keys[0] && !Student.exists?(:email => current_user.email)