app/views/static_pages/index.html.erb

SELECT "students"."Fname" FROM "students" WHERE (email = 'student5@123.com')
---
<% if current_user.role == User.roles.keys[0] %>
 <%=Student.where("email = ?", current_user.email).pluck(:Fname).first%>

SELECT "students".* FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "student5@123.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE (email = 'admin@123.com')
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "student@123.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "czt@123.com"], ["LIMIT", 1]]
---
<%
 if current_user.role == User.roles.keys[0] && !Student.exists?(:email => current_user.email)