app/views/students/index.html.erb

SELECT "students".* FROM "students"
SELECT 1 AS one FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "test1@123.com"], ["LIMIT", 1]]
---
 if current_user.role == User.roles.keys[0]
 if !Student.exists?(:email => current_user.email)