app/views/students/new.html.erb

SELECT 1 AS one FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "test1@123.com"], ["LIMIT", 1]]
---

<% if !current_user.admin? && !Student.exists?(:email => current_user.email) %>