app/views/students/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "czt@123.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "czt@123.com"], ["LIMIT", 1]]
---
<%
 if current_user.role == User.roles.keys[0] && !Student.exists?(:email => current_user.email)