PeerEvaluationTool/app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "desc", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Project 1"], ["desc", "asdf"], ["created_at", "2022-04-11 20:26:56.050040"], ["updated_at", "2022-04-11 20:26:56.050040"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save