PeerEvaluationTool/app/controllers/teams_controller.rb

  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save
---
INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Group 9"], ["created_at", "2022-04-11 20:24:51.705388"], ["updated_at", "2022-04-11 20:24:51.705388"]]