app/views/projects/edit.html.erb

SELECT "teams".* FROM "teams"
---
  <h4><strong>Teams:</strong></h4>
<% @project.teams.each do |team|%>