app/views/projects/show.html.erb

SELECT "teams".* FROM "teams" INNER JOIN "project_teams" ON "teams"."id" = "project_teams"."team_id" WHERE "project_teams"."project_id" = ?  [["project_id", 1]]
---
  <strong>Teams Assigned:</strong>
  <% @project.teams.each do |team|%>