app/controllers/application_controller.rb

SELECT "students"."id" FROM "students" WHERE (email ='student5@123.com')
---
    def get_my_id
      id = Student.where("email =?", current_user.email).pluck(:id).first