app/controllers/projects_controller.rb

  def index
    if current_user.admin?
      @projects = Project.all
    else
      @student = Student.find_by(email: current_user.email)
      @projects = []
      @student.teams.each do |team|
        team.projects.each do |project|
          if !(@projects.include? project)
            @projects << project
---
SELECT "projects".* FROM "projects"
INSERT INTO "projects" ("name", "desc", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Project 1"], ["desc", "asdf"], ["created_at", "2022-04-11 20:26:56.050040"], ["updated_at", "2022-04-11 20:26:56.050040"]]

  def edit
    @teams = Team.all
---
SELECT "teams".* FROM "teams"

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "desc", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Project 1"], ["desc", "asdf"], ["created_at", "2022-04-11 20:26:56.050040"], ["updated_at", "2022-04-11 20:26:56.050040"]]

  def add
    @project = Project.find(params[:project_id])
    @team = Team.find(params[:team_id])
    if !(@project.teams.include? @team)
      @project_teams = ProjectTeam.new(project_id: params[:project_id], team_id: params[:team_id])

      respond_to do |format|
        if @project_teams.save
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "project_teams" ("project_id", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["project_id", 1], ["team_id", 1], ["created_at", "2022-04-20 19:44:59.112394"], ["updated_at", "2022-04-20 19:44:59.112394"]]

  def remove
    @team = Team.find(params[:team_id])
    @project = Project.find(params[:project_id])
    if @project.teams.include? @team
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_project
      id = params[:project_id] || params[:id]
      @project = Project.find(id)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]