app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("personalscore", "workscore", "comment", "created_at", "updated_at", "written_for_id", "project_id") VALUES (?, ?, ?, ?, ?, ?, ?)