app/controllers/reviews_controller.rb

SELECT "students"."id" FROM "students" WHERE (email ='student5@123.com')
---
  def new
    @review = Review.new()
    if !current_user.admin? && !params[:project_id].nil?
      @student = Student.find_by(email: current_user.email)

SELECT "students"."id" FROM "students" WHERE (email ='student5@123.com')
INSERT INTO "reviews" ("personalscore", "workscore", "comment", "created_at", "updated_at", "written_for_id", "project_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @review = Review.new(review_params)
    @student = Student.find_by(email: current_user.email)

    if !@student.nil?
      if @student.id == @review.written_for_id
        check = @student
      else
        check = Student.new
        @student.teams.each do |team|
          team.students.each do |student|
            if student.id != current_user.id && student.id == @review.written_for_id
              check = student
              break
            end
          end
        end
      end

      p_id = []
      check.teams.each do |team|
        team.projects.each do |project|
          if !(p_id.include? project.id)
            p_id << project.id
          end
        end
      end
      if p_id.include? @review.project_id
        respond_to do |format|
          if @review.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_student
      @review = Review.find(params[:id])