app/controllers/students_controller.rb

  def create
      @student = Student.new(student_params)

      respond_to do |format|
        if @student.save
---
INSERT INTO "students" ("Fname", "Lname", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Fname", "as"], ["Lname", "df"], ["email", "asdasd@gmail.com"], ["created_at", "2022-04-14 02:16:49.654114"], ["updated_at", "2022-04-14 02:16:49.654114"]]

  def update
    if current_user.role == User.roles.keys[0] && @student.email == current_user.email
      respond_to do |format|
        if @student.update(student_params)
---
UPDATE "students" SET "updated_at" = ?, "student_id" = ? WHERE "students"."id" = ?  [["updated_at", "2022-04-14 02:21:39.965732"], ["student_id", 3], ["id", 1]]

  def destroy
    if current_user.role == User.roles.keys[0] && @student.email == current_user.email
      @student.teams.clear
      @student.save
      @reviews = Review.where("written_by_id =?", @student.id)
      @reviews.each do |review|
        review.destroy
      end
      @reviews = Review.where("written_for_id =?", @student.id)
      @reviews.each do |review|
        review.destroy
      end
      @student.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 34]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 13]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 18]]