app/controllers/teams_controller.rb

  def index
    @teams = Team.all
    @students = Student.all
---
SELECT "teams".* FROM "teams"
SELECT "students".* FROM "students"

  def new
    @team = Team.new
    @students = Student.all
---
SELECT "students".* FROM "students"

  def edit
    @students = Student.all
---
SELECT "students".* FROM "students"

  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save
---
INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "teamtest"], ["created_at", "2022-04-19 05:41:40.474918"], ["updated_at", "2022-04-19 05:41:40.474918"]]

  def update
    respond_to do |format|
      if @team.update(team_params)
---
UPDATE "teams" SET "name" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["name", "Group 7"], ["updated_at", "2022-04-19 05:45:39.987229"], ["id", 1]]

  def add
    @student_teams = StudentTeam.new(team_id: params[:team_id], student_id: params[:student_id])
    @student_teams.save
---
INSERT INTO "student_teams" ("student_id", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["student_id", 16], ["team_id", 4], ["created_at", "2022-04-20 18:33:08.304268"], ["updated_at", "2022-04-20 18:33:08.304268"]]

  def add_students
    @team = Team.find(params[:id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def remove_student
    @team = Team.find param[:team_id]
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

    def set_team
      id = params[:team_id] || params[:id]
      @team = Team.find(id)
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]