app/controllers/teams_controller.rb

  def remove_student
    @team = Team.find param[:team_id]
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]