app/views/reviews/_form.html.erb

<% p_id = params[:project_id]
project = Project.find_by(id: p_id)
teammates = []
me = Student.find_by(email: current_user.email)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "students"."id" FROM "students" WHERE (email ='student5@123.com')