app/views/reviews/index.html.erb

<%
if current_user.role == User.roles.keys[0] && !Student.exists?(:email => current_user.email)
---
SELECT 1 AS one FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "czt@123.com"], ["LIMIT", 1]]