app/views/reviews/new.html.erb

<%
 if current_user.role == User.roles.keys[0] && !Student.exists?(:email => current_user.email)
---
SELECT "students"."id" FROM "students" WHERE (email ='student5@123.com')
SELECT 1 AS one FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "czt@123.com"], ["LIMIT", 1]]