app/views/reviews/show.html.erb

SELECT 1 AS one FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "czt@123.com"], ["LIMIT", 1]]
---
<%
 if current_user.role == User.roles.keys[0] && !Student.exists?(:email => current_user.email)