app/views/reviews/show.html.erb

<p id="notice"><%= notice %></p>
<% @review = Review.find(params[:id])%>
---
SELECT "reviews".* FROM "reviews" WHERE (written_for_id =8)

  <strong>Written By:</strong>
  <%student = Student.find_by(params[@review.written_by_id])%>
---
SELECT "students"."id" FROM "students" WHERE (email ='student2@123.com')